Revit 2027 API
TrussCurveType Enumeration
Types of curves created in truss families.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TrussCurveType
Public Enumeration TrussCurveType
public enum class TrussCurveType
type TrussCurveType
Members
Member name | Value | Description
BottomChord | 2
NonTrussCurve | 0
TopChord | 1
Web | 3
See Also
Reference
Autodesk.Revit.DB.Structure Namespace